ItsRebaseTime/ESP32-BLE-CompositeHID/DualSenseGamepadDevice.cpp
    // Set callbacks on all characteristics so we can track reads/writes
    input->setCallbacks(_callbacks);
    _minimalInput->setCallbacks(_callbacks);
    output->setCallbacks(_callbacks);

    // pending callbacks for pairing and stuff
    _calibration = hid->getFeatureReport(DUALSENSE_CALIBRATION_REPORT_ID);
    _calibration->setCallbacks(_callbacks);
    _firmwareInfo = hid->getFeatureReport(DUALSENSE_FIRMWARE_INFO_REPORT_ID);
    _firmwareInfo->setCallbacks(_callbacks);
    _pairingInfo = hid->getFeatureReport(DUALSENSE_PAIRING_INFO_REPORT_ID);
    _pairingInfo->setCallbacks(_callbacks);
    _btPatchInfo = hid->getFeatureReport(DUALSENSE_BT_PATCH_REPORT_ID);
    _btPatchInfo->setCallbacks(_callbacks);
    // memcpy(_pairingReport.mac_address,hid->esp_bt_dev_get_address();
    setCharacteristics(input, output);

    // Log characteristic handles for debugging
    ESP_LOGI(LOG_TAG, "Characteristic handles: input=%d, output=%d, calibration=%d, firmwareInfo=%d, pairingInfo=%d",
        input->getHandle(), output->getHandle(), _calibration->getHandle(),
        _firmwareInfo->getHandle(), _pairingInfo->getHandle());
    m_pCrcTable = new uint32_t[256];
    generate_crc_table(m_pCrcTable);

    // Pre-populate feature reports so they're ready when host reads them
    // This is critical for Steam to recognize controller capabilities (vibration, etc.)
    ESP_LOGI(LOG_TAG, "Pre-populating feature reports...");

    uint8_t calibBuf[DUALSENSE_CALIBRATION_REPORT_SIZE];
    buildFeatureReportWithCrc(DUALSENSE_CALIBRATION_REPORT_ID,
        DualsenseEdge_StockCalibration, DUALSENSE_CALIBRATION_REPORT_SIZE - 4,
        calibBuf, DUALSENSE_CALIBRATION_REPORT_SIZE);
    _calibration->setValue(calibBuf, DUALSENSE_CALIBRATION_REPORT_SIZE);

    uint8_t firmBuf[DUALSENSE_FIRMWARE_INFO_REPORT_SIZE];
    buildFeatureReportWithCrc(DUALSENSE_FIRMWARE_INFO_REPORT_ID,
        DualsenseEdge_FirmwareInfo, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE - 4,
        firmBuf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
    _firmwareInfo->setValue(firmBuf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);

    // Pairing info report (0x09) - includes MAC address
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_BT);
    memcpy(_pairingReport.mac_address, mac, 6);
    memcpy(_pairingReport.common, (uint8_t*)&DualsenseEdge_PairInfo_common, 9);
    uint8_t pairHdr[] = { PS_FEATURE_CRC32_SEED, DUALSENSE_PAIRING_INFO_REPORT_ID };
    uint32_t pairCrc = crc32_le(0xFFFFFFFF, pairHdr, sizeof(pairHdr));
    pairCrc = ~crc32_le(pairCrc, (uint8_t*)&_pairingReport, sizeof(_pairingReport) - 4);
    _pairingReport.crc32 = pairCrc;
    _pairingInfo->setValue((uint8_t*)&_pairingReport, DUALSENSE_PAIRING_INFO_REPORT_SIZE);

    // BT patch version (0x22) - zero-filled payload + CRC. DSX reads this during
    // handshake; if the characteristic doesn't exist or size mismatches, Windows
    // rejects the GATT read with Win32 error 87 and tears down the HID session.
    uint8_t btPatchBuf[DUALSENSE_BT_PATCH_REPORT_SIZE];
    uint8_t btPatchPayload[DUALSENSE_BT_PATCH_REPORT_SIZE - 4] = { 0 };
    buildFeatureReportWithCrc(DUALSENSE_BT_PATCH_REPORT_ID,
        btPatchPayload, sizeof(btPatchPayload),
        btPatchBuf, DUALSENSE_BT_PATCH_REPORT_SIZE);
    _btPatchInfo->setValue(btPatchBuf, DUALSENSE_BT_PATCH_REPORT_SIZE);

    // Minimal 0x01 input report default: sticks centered (0x80), hat = 8 (centered/null),
    // buttons = 0, triggers = 0. Layout: X,Y,Z,Rz, (hat+pad), btnLo, btnHi, Rx, Ry.
    uint8_t minimalDefault[DUALSENSE_MINIMAL_INPUT_REPORT_SIZE] = {
        0x80, 0x80, 0x80, 0x80,  // X, Y, Z, Rz (sticks centered)
        0x08,                     // hat = 8 (null) in low nibble, high nibble pad
        0x00, 0x00,              // 14 buttons + 6 bits padding
        0x00, 0x00               // Rx, Ry (triggers)
    };
    _minimalInput->setValue(minimalDefault, sizeof(minimalDefault));

    ESP_LOGI(LOG_TAG, "Feature reports pre-populated");
}

void DualsenseGamepadDevice::buildFeatureReportWithCrc(
    uint8_t reportId, const uint8_t* payload, size_t payloadSize,
    uint8_t* outBuffer, size_t outSize)
{
    if (outSize < payloadSize + 4) return;
    memcpy(outBuffer, payload, payloadSize);
    uint8_t hdr[] = { PS_FEATURE_CRC32_SEED, reportId };
    uint32_t crc = crc32_le(0xFFFFFFFF, hdr, sizeof(hdr));
    crc = ~crc32_le(crc, outBuffer, payloadSize);
    outBuffer[payloadSize + 0] = (uint8_t)(crc & 0xFF);
    outBuffer[payloadSize + 1] = (uint8_t)((crc >> 8) & 0xFF);
    outBuffer[payloadSize + 2] = (uint8_t)((crc >> 16) & 0xFF);
    outBuffer[payloadSize + 3] = (uint8_t)((crc >> 24) & 0xFF);
}

const BaseCompositeDeviceConfiguration* DualsenseGamepadDevice::getDeviceConfig() const
{
    // Return the device configuration
    return _config;
}

void DualsenseGamepadDevice::resetInputs()
{
    std::lock_guard<std::mutex> lock(_mutex);
    memset(&_inputReport, 0, sizeof(DualsenseGamepadInputReportData));

    _inputReport.bt = 0x01;  // BLE header: HasHID=1 (contains state data)
    _inputReport.x  = DUALSENSE_AXIS_CENTER_OFFSET;  // left stick X
    _inputReport.y  = DUALSENSE_AXIS_CENTER_OFFSET;  // left stick Y
    _inputReport.rx = DUALSENSE_AXIS_CENTER_OFFSET;  // right stick X
    _inputReport.ry = DUALSENSE_AXIS_CENTER_OFFSET;  // right stick Y
    _inputReport.z  = 0;                              // L2 trigger (rest)
    _inputReport.rz = 0;                              // R2 trigger (rest)
    _inputReport.seq = 0x20;
    _inputReport.buttons[0] = 0;
    _inputReport.buttons[1] = 0;
    _inputReport.buttons[2] = 0;
    hat_set(_inputReport.buttons, DUALSENSE_BUTTON_DPAD_NONE);
    _inputReport.extra_buttons = 0;
    _inputReport.touchpoint_l_contact = 0x80;
    _inputReport.touchpoint_r_contact = 0x80;
    _inputReport.timestamp = 0x7621DD40;
    _inputReport.status = 0x0A;  // 100% battery, discharging

    // Controller at rest: ~1g on the axis facing down.
    _inputReport.accel_x = 0;
    _inputReport.accel_y = -DUALSENSE_ACC_RES_PER_G;
    _inputReport.accel_z = 0;

    _inputReport.gyro_x = 0;
    _inputReport.gyro_y = 0;
    _inputReport.gyro_z = 0;
}

void DualsenseGamepadDevice::press(uint32_t button)
{
    if (!isPressed(button)) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            buttons_set(_inputReport.buttons, button);
            ESP_LOGD(LOG_TAG, "DualsenseGamepadDevice::press, button: %d", button);
        }

