ItsRebaseTime/ESP32-BLE-CompositeHID/DualSenseGamepadDevice.cpp
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}
void DualsenseGamepadDevice::setLeftTouchpad(uint16_t x, uint16_t y)
{

    if (_inputReport.touchpoint_l_contact != 0x00) {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.touchpoint_l_contact = 0x00;
    }
    _inputReport.touchpoint_l_x = x & 0xFFF;
    _inputReport.touchpoint_l_y = y & 0xFFF;
    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}
void DualsenseGamepadDevice::setRightTouchpad(uint16_t x, uint16_t y)
{

    if (_inputReport.touchpoint_r_contact != 0x00) {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.touchpoint_r_contact = 0x00;
    }
    _inputReport.touchpoint_r_x = x & 0xFFF;
    _inputReport.touchpoint_r_y = y & 0xFFF;
    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}
void DualsenseGamepadDevice::releaseLeftTouchpad()
{
    _inputReport.touchpoint_l_contact = 0x80;
    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}
void DualsenseGamepadDevice::releaseRightTouchpad()
{
    _inputReport.touchpoint_r_contact = 0x80;
    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}

void DualsenseGamepadDevice::release(uint32_t button)
{
    if (isPressed(button)) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            buttons_clear(_inputReport.buttons, button);
            ESP_LOGD(LOG_TAG, "DualsenseGamepadDevice::release, button: %d", button);
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

bool DualsenseGamepadDevice::isPressed(uint32_t button)
{
    std::lock_guard<std::mutex> lock(_mutex);
    return buttons_test(_inputReport.buttons, button);
}

void DualsenseGamepadDevice::setLeftThumb(int8_t x, int8_t y)
{
    x = constrain(x, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);
    y = constrain(y, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);

    if (_inputReport.x != x || _inputReport.y != y) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.x = (uint8_t)(x + DUALSENSE_AXIS_CENTER_OFFSET);
            _inputReport.y = (uint8_t)(y + DUALSENSE_AXIS_CENTER_OFFSET);
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setRightThumb(int8_t x, int8_t y)
{
    x = constrain(x, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);
    y = constrain(y, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);

    uint8_t rx = (uint8_t)(x + DUALSENSE_AXIS_CENTER_OFFSET);
    uint8_t ry = (uint8_t)(y + DUALSENSE_AXIS_CENTER_OFFSET);

    if (_inputReport.rx != rx || _inputReport.ry != ry) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.rx = rx;
            _inputReport.ry = ry;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setLeftTrigger(uint8_t value)
{
    value = constrain(value, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);

    if (_inputReport.z != value) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.z = value;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setRightTrigger(uint8_t value)
{
    value = constrain(value, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);

    if (_inputReport.rz != value) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.rz = value;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setGyro(int16_t pitch, int16_t yaw, int16_t roll)
{
    pitch = constrain(pitch, -DUALSENSE_GYRO_RANGE, DUALSENSE_GYRO_RANGE);
    yaw = constrain(yaw, -DUALSENSE_GYRO_RANGE, DUALSENSE_GYRO_RANGE);
    roll = constrain(roll, -DUALSENSE_GYRO_RANGE, DUALSENSE_GYRO_RANGE);

    if (_inputReport.gyro_x != pitch || _inputReport.gyro_y != yaw || _inputReport.gyro_z != roll) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.gyro_x = pitch;
            _inputReport.gyro_y = yaw;
            _inputReport.gyro_z = roll;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}
void DualsenseGamepadDevice::setAccel(int16_t x, int16_t y, int16_t z)
{
    x = constrain(x, -DUALSENSE_ACC_RANGE, DUALSENSE_ACC_RANGE);
    y = constrain(y, -DUALSENSE_ACC_RANGE, DUALSENSE_ACC_RANGE);
    z = constrain(z, -DUALSENSE_ACC_RANGE, DUALSENSE_ACC_RANGE);

    if (_inputReport.accel_x != x || _inputReport.accel_y != y || _inputReport.accel_z != z) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.accel_x = x;
            _inputReport.accel_y = y;
            _inputReport.accel_z = z;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setTriggers(uint8_t left, uint8_t right)
{
    left = constrain(left, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);
    right = constrain(right, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);

    if (_inputReport.z != left || _inputReport.rz != right) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.z = left;
            _inputReport.rz = right;
        }
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::pressDPadDirection(uint8_t direction)
{

    // Avoid double presses
    if (!isDPadPressed(direction)) {
        ESP_LOGD(LOG_TAG, "Pressing dpad direction %s", dPadDirectionName(direction).c_str());
        {
            std::lock_guard<std::mutex> lock(_mutex);
            hat_set(_inputReport.buttons, direction);
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::pressDPadDirectionFlag(DualsenseDpadFlags direction)
{
    // Filter opposite button presses
    if ((direction & (DualsenseDpadFlags::NORTH | DualsenseDpadFlags::SOUTH)) == (DualsenseDpadFlags::NORTH | DualsenseDpadFlags::SOUTH)) {
        ESP_LOGD(LOG_TAG, "Filtering opposite button presses - up down");
        direction = (DualsenseDpadFlags)(direction ^ (uint8_t)(DualsenseDpadFlags::NORTH | DualsenseDpadFlags::SOUTH));
    }
    if ((direction & (DualsenseDpadFlags::EAST | DualsenseDpadFlags::WEST)) == (DualsenseDpadFlags::EAST | DualsenseDpadFlags::WEST)) {
        ESP_LOGD(LOG_TAG, "Filtering opposite button presses - left right");
        direction = (DualsenseDpadFlags)(direction ^ (uint8_t)(DualsenseDpadFlags::EAST | DualsenseDpadFlags::WEST));
    }

