ItsRebaseTime/ESP32-BLE-CompositeHID/DualSenseGamepadDevice.cpp
    pressDPadDirection(dPadDirectionToValue(direction));
}

void DualsenseGamepadDevice::releaseDPad()
{
    pressDPadDirection(DUALSENSE_BUTTON_DPAD_NONE);
}

bool DualsenseGamepadDevice::isDPadPressed(uint8_t direction)
{
    std::lock_guard<std::mutex> lock(_mutex);
    return hat_get(_inputReport.buttons) == direction;
}

bool DualsenseGamepadDevice::isDPadPressedFlag(DualsenseDpadFlags direction)
{
    std::lock_guard<std::mutex> lock(_mutex);
    uint8_t hat = hat_get(_inputReport.buttons);

    if (direction == DualsenseDpadFlags::NORTH) {
        return hat == DUALSENSE_BUTTON_DPAD_NORTH;
    } else if (direction == (DualsenseDpadFlags::NORTH | DualsenseDpadFlags::EAST)) {
        return hat == DUALSENSE_BUTTON_DPAD_NORTHEAST;
    } else if (direction == DualsenseDpadFlags::EAST) {
        return hat == DUALSENSE_BUTTON_DPAD_EAST;
    } else if (direction == (DualsenseDpadFlags::SOUTH | DualsenseDpadFlags::EAST)) {
        return hat == DUALSENSE_BUTTON_DPAD_SOUTHEAST;
    } else if (direction == DualsenseDpadFlags::SOUTH) {
        return hat == DUALSENSE_BUTTON_DPAD_SOUTH;
    } else if (direction == (DualsenseDpadFlags::SOUTH | DualsenseDpadFlags::WEST)) {
        return hat == DUALSENSE_BUTTON_DPAD_SOUTHWEST;
    } else if (direction == DualsenseDpadFlags::WEST) {
        return hat == DUALSENSE_BUTTON_DPAD_WEST;
    } else if (direction == (DualsenseDpadFlags::NORTH | DualsenseDpadFlags::WEST)) {
        return hat == DUALSENSE_BUTTON_DPAD_NORTHWEST;
    }
    return false;
}

void DualsenseGamepadDevice::seq()
{
    if (_inputReport.seq < 254) {
        _inputReport.seq += 1;
    } else {
        _inputReport.seq = 0;
    }

    sendGamepadReport();
}
void DualsenseGamepadDevice::timestamp()
{
    uint32_t cycles = ESP.getCycleCount() / 1500;

    _inputReport.timestamp = cycles;
}

void DualsenseGamepadDevice::sendGamepadReport(bool defer)
{
    if (defer || _config->getAutoDefer()) {
        queueDeferredReport(std::bind(&DualsenseGamepadDevice::sendGamepadReportImpl, this));
    } else {
        sendGamepadReportImpl();
    }
}
void DualsenseGamepadDevice::sendFirmInfoReport(bool defer)
{
    if (defer || _config->getAutoDefer()) {
        queueDeferredReport(std::bind(&DualsenseGamepadDevice::sendFirmInfoReportImpl, this));
    } else {
        sendFirmInfoReportImpl();
    }
}
void DualsenseGamepadDevice::sendCalibrationReport(bool defer)
{
    if (defer || _config->getAutoDefer()) {
        queueDeferredReport(std::bind(&DualsenseGamepadDevice::sendCalibrationReportImpl, this));
    } else {
        sendCalibrationReportImpl();
    }
}
void DualsenseGamepadDevice::sendPairingInfoReport(bool defer)
{
    if (defer || _config->getAutoDefer()) {
        queueDeferredReport(std::bind(&DualsenseGamepadDevice::sendPairingInfoReportImpl, this));
    } else {
        sendPairingInfoReportImpl();
    }
}
void DualsenseGamepadDevice::sendGamepadReportImpl()
{
    auto input = getInput();
    auto parentDevice = this->getParent();

    if (!input || !parentDevice)
        return;

    if (!parentDevice->isConnected())
        return;

    {
        std::lock_guard<std::mutex> lock(_mutex);
        size_t packedSize = sizeof(_inputReport);
        ESP_LOGD(LOG_TAG, "Sending gamepad report, size: %d", packedSize);
        uint8_t bthdr[] = { PS_INPUT_CRC32_SEED, DUALSENSE_EDGE_INPUT_REPORT_ID };
        uint32_t crc = 0;
        crc = this->crc32_le(0xFFFFFFFF, (uint8_t*)&bthdr, sizeof(bthdr));
        crc = ~this->crc32_le(crc, (uint8_t*)&_inputReport, sizeof(_inputReport) - 4);
        _inputReport.crc32 = crc;
        ESP_LOGD(LOG_TAG, "got input CRC %lx", crc);
        input->setValue((uint8_t*)&_inputReport, sizeof(_inputReport));
    }
    input->notify();
}
void DualsenseGamepadDevice::sendFirmInfoReportImpl()
{
    auto firminfo = _firmwareInfo;
    auto parentDevice = this->getParent();

    if (!firminfo || !parentDevice)
        return;

    if (!parentDevice->isConnected())
        return;

    {
        std::lock_guard<std::mutex> lock(_mutex);
        size_t packedSize = DUALSENSE_FIRMWARE_INFO_REPORT_SIZE;
        ESP_LOGD(LOG_TAG, "Sending firmware info report, size: %d", packedSize);
        uint8_t buf[DUALSENSE_FIRMWARE_INFO_REPORT_SIZE];
        buildFeatureReportWithCrc(DUALSENSE_FIRMWARE_INFO_REPORT_ID,
            DualsenseEdge_FirmwareInfo, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE - 4,
            buf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
        firminfo->setValue(buf, packedSize);
    }
    firminfo->indicate();
}
void DualsenseGamepadDevice::sendCalibrationReportImpl()
{
    auto calibration = _calibration;
    auto parentDevice = this->getParent();

    if (!calibration || !parentDevice)
        return;

    if (!parentDevice->isConnected())
        return;

    {
        std::lock_guard<std::mutex> lock(_mutex);
        size_t packedSize = DUALSENSE_CALIBRATION_REPORT_SIZE;
        ESP_LOGD(LOG_TAG, "Sending calibration report, size: %d", packedSize);
        uint8_t buf[DUALSENSE_CALIBRATION_REPORT_SIZE];
        buildFeatureReportWithCrc(DUALSENSE_CALIBRATION_REPORT_ID,
            DualsenseEdge_StockCalibration, DUALSENSE_CALIBRATION_REPORT_SIZE - 4,
            buf, DUALSENSE_CALIBRATION_REPORT_SIZE);
        calibration->setValue(buf, packedSize);
    }
    calibration->indicate();
}
void DualsenseGamepadDevice::sendPairingInfoReportImpl()
{
    ESP_LOGD(LOG_TAG, "Sending Pairing report");
    auto pairinginfo = _pairingInfo;
    auto parentDevice = this->getParent();
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_BT);
    memcpy(_pairingReport.mac_address, mac, 6);
    memcpy(_pairingReport.common, (uint8_t*)&DualsenseEdge_PairInfo_common, 9);
    if (!pairinginfo || !parentDevice)
        return;

    if (!parentDevice->isConnected())
        return;

    {
        std::lock_guard<std::mutex> lock(_mutex);
        uint8_t bthdr[] = { PS_FEATURE_CRC32_SEED, DUALSENSE_PAIRING_INFO_REPORT_ID };
        uint32_t crc = 0;
        crc = this->crc32_le(0xFFFFFFFF, (uint8_t*)&bthdr, sizeof(bthdr));
        crc = ~this->crc32_le(crc, (uint8_t*)&_pairingReport, sizeof(_pairingReport) - 4);
        _pairingReport.crc32 = crc;
        ESP_LOGD(LOG_TAG, "got pairing CRC %lx", crc);
        size_t packedSize = DUALSENSE_PAIRING_INFO_REPORT_SIZE;
        ESP_LOGD(LOG_TAG, "Sending Pair report, size: %d", packedSize);
        pairinginfo->setValue((uint8_t*)&_pairingReport, packedSize);
    }
    pairinginfo->indicate();
}

