ItsRebaseTime/ESP32-BLE-CompositeHID/DualSenseGamepadDevice.cpp
void DualsenseGamepadDevice::populateFeatureReportOnRead(NimBLECharacteristic* pCharacteristic)
{
    // Identify which feature report is being read and populate it
    // This ensures Steam/host gets valid data when it reads feature reports

    // Debug: log the handles to help identify which characteristic is which
    ESP_LOGI(LOG_TAG, "populateFeatureReportOnRead: pChar=%p, _output=%p, _calibration=%p, _firmwareInfo=%p, _pairingInfo=%p, _btPatchInfo=%p",
        (void*)pCharacteristic, (void*)getOutput(), (void*)_calibration, (void*)_firmwareInfo, (void*)_pairingInfo, (void*)_btPatchInfo);

    if (pCharacteristic == getOutput()) {
        // Steam reads from output characteristic to check if device supports output reports
        // Provide an empty/default output report structure
        ESP_LOGI(LOG_TAG, "Host reading output report (0x31) - providing default data");
        // Return a valid but empty output report (78 bytes for BLE format)
        static uint8_t defaultOutputReport[DS_OUTPUT_REPORT_BT_SIZE] = {0};
        defaultOutputReport[0] = 0x31;  // Report ID
        defaultOutputReport[2] = 0x10;  // Tag (DS_OUTPUT_TAG)
        std::lock_guard<std::mutex> lock(_mutex);
        pCharacteristic->setValue(defaultOutputReport, DS_OUTPUT_REPORT_BT_SIZE);
    }
    else if (pCharacteristic == _calibration) {
        ESP_LOGI(LOG_TAG, "Host reading calibration report (0x05) - populating data and sending input report");
        {
            std::lock_guard<std::mutex> lock(_mutex);
            uint8_t buf[DUALSENSE_CALIBRATION_REPORT_SIZE];
            buildFeatureReportWithCrc(DUALSENSE_CALIBRATION_REPORT_ID,
                DualsenseEdge_StockCalibration, DUALSENSE_CALIBRATION_REPORT_SIZE - 4,
                buf, DUALSENSE_CALIBRATION_REPORT_SIZE);
            pCharacteristic->setValue(buf, DUALSENSE_CALIBRATION_REPORT_SIZE);
        }
        // When calibration is read, also send an input report with valid sensor data
        // This helps Steam associate the calibration with valid gyro/accel readings
        sendGamepadReportImpl();
    }
    else if (pCharacteristic == _firmwareInfo) {
        ESP_LOGI(LOG_TAG, "Host reading firmware info report (0x20) - populating data");
        std::lock_guard<std::mutex> lock(_mutex);
        uint8_t buf[DUALSENSE_FIRMWARE_INFO_REPORT_SIZE];
        buildFeatureReportWithCrc(DUALSENSE_FIRMWARE_INFO_REPORT_ID,
            DualsenseEdge_FirmwareInfo, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE - 4,
            buf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
        pCharacteristic->setValue(buf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
    }
    else if (pCharacteristic == _pairingInfo) {
        ESP_LOGI(LOG_TAG, "Host reading pairing info report (0x09) - populating data");
        // Build pairing report with MAC address
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_BT);
        memcpy(_pairingReport.mac_address, mac, 6);
        memcpy(_pairingReport.common, (uint8_t*)&DualsenseEdge_PairInfo_common, 9);

        // Calculate CRC
        uint8_t bthdr[] = { PS_FEATURE_CRC32_SEED, DUALSENSE_PAIRING_INFO_REPORT_ID };
        uint32_t crc = 0;
        crc = this->crc32_le(0xFFFFFFFF, (uint8_t*)&bthdr, sizeof(bthdr));
        crc = ~this->crc32_le(crc, (uint8_t*)&_pairingReport, sizeof(_pairingReport) - 4);
        _pairingReport.crc32 = crc;

        std::lock_guard<std::mutex> lock(_mutex);
        pCharacteristic->setValue((uint8_t*)&_pairingReport, DUALSENSE_PAIRING_INFO_REPORT_SIZE);
    }
    else if (pCharacteristic == _btPatchInfo) {
        ESP_LOGI(LOG_TAG, "Host reading BT patch version report (0x22) - populating data");
        std::lock_guard<std::mutex> lock(_mutex);
        uint8_t buf[DUALSENSE_BT_PATCH_REPORT_SIZE];
        uint8_t payload[DUALSENSE_BT_PATCH_REPORT_SIZE - 4] = { 0 };
        buildFeatureReportWithCrc(DUALSENSE_BT_PATCH_REPORT_ID,
            payload, sizeof(payload),
            buf, DUALSENSE_BT_PATCH_REPORT_SIZE);
        pCharacteristic->setValue(buf, DUALSENSE_BT_PATCH_REPORT_SIZE);
    }
    else if (pCharacteristic == getInput()) {
        // Input report being read - this is normal, Steam may read it to check current state
        ESP_LOGI(LOG_TAG, "Host reading input report - providing current state");
        // The input report is already populated with current gamepad state
        // No additional action needed
    }
    else {
        ESP_LOGW(LOG_TAG, "Unknown feature report read request (handle=%d)", pCharacteristic->getHandle());
    }
}

// taken from https://github.com/StryderUK/BluetoothHID/blob/main/examples/DualShock4
uint32_t DualsenseGamepadDevice::crc32_le(unsigned int crc, unsigned char const* buf, unsigned int len)
{
    uint32_t i;
    for (i = 0; i < len; i++) {
        crc = m_pCrcTable[(crc ^ buf[i]) & 0xff] ^ (crc >> 8);
    }
    return crc;
}
void DualsenseGamepadDevice::generate_crc_table(uint32_t* crcTable)
{
    const uint32_t POLYNOMIAL = 0xEDB88320; // 0x04C11DB7 reversed
    uint32_t remainder;
    uint8_t b = 0;
    do {
        // Start with the data byte
        remainder = b;
        for (unsigned long bit = 8; bit > 0; --bit) {
            if (remainder & 1)
                remainder = (remainder >> 1) ^ POLYNOMIAL;
            else
                remainder = (remainder >> 1);
        }
        crcTable[(size_t)b] = remainder;
    } while (0 != ++b);
}
